In [1]:
from scipy import stats
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from pydataset import data
import env
import new_lib as lib

# For each of the following questions, formulate a null and alternative hypothesis (be as specific as you can be), then give an example of what a true positive, true negative, type I and type II errors would look like. Note that some of the questions are intentionally phrased in a vague way. It is your job to reword these as more precise questions that could be tested.

## Has the network latency gone up since we switched internet service providers?
##### H0 = Network latency has not gone up since changing between service providers
##### Ha = Network latency has gone up since changing between service providers
##### True Positive = Finding that the latency has increased since changing 
##### True Negative = Finding that the latency has not changed when switching providers
##### Type 1 = Finding that latency has not changed despite there being real change
##### Type 2 = Finding change in latency despite no change occuring or latency increasing not due to provider

## Is the website redesign any good?
##### H0 = The redesign has no affect or negative affect on the clicks on our website
##### Ha = The redesign has increased clicks on the redesign
##### True Positive = Finding that clicks have increased after the redesign
##### True Negative = Finding that clicks have not changed after redesign
##### Type 1 = Finding that clicks were not effected incorrectly
##### Type 2 = Finding that clicks were effected by the redesign when there was either another reason or they were not actually effected

## Is our television ad driving more sales?
##### H0 = Sales are not increasing due to the ad or sales decreased
##### Ha = Sales are increasing due to the ad
##### True Positive = Find that Sales have increased due to the advertisment
##### True Negative = Find that the advertisment is not driving sales to increase
##### Type 1 = Find that Sales are being increased due to the advertisement incorrectly when Sales are increasing due to other factors
##### Type 2 = Find that Sales are not being driven by ads when they in fact are being driven by it

## Answer with the type of test you would use (assume normal distribution):

###### Is there a difference in grades of students on the second floor compared to grades of all students?
###### Are adults who drink milk taller than adults who dont drink milk?
###### Is the the price of gas higher in texas or in new mexico?
###### Are there differences in stress levels between students who take data science vs students who take web development vs students who take cloud academy?

##### Use a one sample T test
##### Use a two sample T test
##### Use a two sample T test
##### Use an ANOVA test

## Ace Realty wants to determine whether the average time it takes to sell homes is different for its two offices. A sample of 40 sales from office #1 revealed a mean of 90 days and a standard deviation of 15 days. A sample of 50 sales from office #2 revealed a mean of 100 days and a standard deviation of 20 days. Use a .05 level of significance.

In [2]:
rng = np.random.default_rng(42)
o1s = 40
o1m = 90
o1std = 15
o2s = 50
o2m = 100
o2std = 20
alpha = .05

office1 = rng.normal(o1m, o1std, size = o1s)
office2 = rng.normal(o2m, o2std, size = o2s)
stats.levene(office1,office2)

LeveneResult(statistic=0.7021879366006201, pvalue=0.4043197217974548)

In [3]:
t, p = stats.ttest_ind(office1, office2, equal_var = False)
t, p

(-3.2897905409176866, 0.0014483269202186886)

In [4]:
print('Reject H0', p <= alpha)
## They are not equal

Reject H0 True

## Load the mpg dataset and use it to answer the following questions:

###### Is there a difference in fuel-efficiency in cars from 2008 vs 1999?
###### Are compact cars more fuel-efficient than the average car?
###### Do manual cars get better gas mileage than automatic cars?

In [5]:
mpg = data('mpg')

In [6]:
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [40]:
mpg['fuel_efficiency'] = (mpg.cty + mpg.hwy)/2
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,fuel_efficiency,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,23.5,automatic
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,25.0,manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,25.5,manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,25.5,automatic
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,21.0,automatic
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,23.5,automatic
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,25.0,manual
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,21.0,automatic
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,22.0,manual
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,21.5,automatic

In [8]:
old_cars = mpg.fuel_efficiency[mpg.year == 1999]
new_cars = mpg.fuel_efficiency[mpg.year == 2008]
old_cars

1      23.5
2      25.0
5      21.0
6      22.0
8      22.0
9      20.5
12     20.0
13     21.0
16     19.5
22     15.0
24     21.0
25     19.0
31     13.0
32     15.5
33     23.0
35     22.0
38     21.0
39     20.5
40     19.0
41     19.0
45     18.5
46     18.0
51     15.0
52     15.5
56     14.0
57     13.0
58     15.0
62     13.5
64     13.0
71     13.0
72     13.5
74     13.0
75     14.0
76     14.0
78     15.5
79     17.0
80     15.5
83     15.0
84     15.5
85     15.5
86     14.5
87     14.5
89     13.0
91     22.0
92     21.5
95     18.0
96     18.5
100    30.5
101    28.0
102    28.5
103    26.0
104    28.0
109    22.0
110    22.5
113    22.0
114    22.0
116    22.5
117    24.0
125    17.5
126    15.5
131    13.0
134    13.0
135    14.0
136    13.5
138    15.5
141    15.0
142    25.0
143    23.0
148    22.0
149    22.0
151    15.5
152    16.0
155    22.0
156    21.0
157    22.0
160    21.5
161    21.0
166    23.5
167    22.5
168    22.5
169    22.5
174    17.5
175    18.0
176    17.0
177    16.0
180    25.0
181    24.0
184    22.0
185    22.0
187    24.0
188    25.0
191    22.0
192    22.0
194    27.0
195    28.5
196    30.5
199    13.0
201    17.5
202    18.0
204    16.0
205    17.0
208    25.0
209    22.5
212    20.5
213    38.5
214    25.0
215    22.5
220    19.5
221    20.5
222    39.5
223    35.0
224    25.0
225    22.5
228    25.0
229    23.5
232    21.0
233    22.0
Name: fuel_efficiency, dtype: float64

In [9]:
## old_norm = np.random.normal(old_cars.mean(), old_cars.std(), size = len(old_cars))
## new_norm = np.random.normal(new_cars.mean(), new_cars.std(), size = len(new_cars))
## incorrectly made random data when actual data is provided

In [10]:
old_cars.var(), new_cars.var()
stats.levene(old_cars,new_cars)

LeveneResult(statistic=0.033228136671080453, pvalue=0.855517569468803)

In [11]:
t, p = stats.ttest_ind(old_cars, new_cars, equal_var= False)
t, p

(0.21960177245940962, 0.8263750772060638)

In [12]:
print('Reject H0', p < alpha)
## They are not different

Reject H0 False

In [13]:
compact = mpg.fuel_efficiency[mpg['class'] == 'compact']
avg_car = mpg.fuel_efficiency.mean()

In [14]:
t, p = stats.ttest_1samp(compact, avg_car)
t, p/2, alpha

(7.896888573132533, 2.0992818971585743e-10, 0.05)

In [15]:
if p/2 > alpha:
    print('Compact is not more efficient')
elif t < 0:
    print('Compact is not more efficient')
else:
    print('Compact is more efficient')
# Compact cars are more fuel efficient than the average car

Compact is more efficient

In [16]:
mpg['is_automatic'] = np.where(mpg.trans.str.contains('auto'), 'automatic', 'manual')

In [17]:
automatic = mpg.fuel_efficiency[mpg.is_automatic == 'automatic']
manual = mpg.fuel_efficiency[mpg.is_automatic == 'manual']

In [18]:
automatic.var(), manual.var()
stats.levene(automatic,manual)

LeveneResult(statistic=0.20075824847529639, pvalue=0.6545276355131857)

In [19]:
t, p =stats.ttest_ind(manual, automatic, equal_var = False)
t, p

(4.443514012903072, 1.7952248999917893e-05)

In [20]:
if p/2 > alpha:
    print('Manual cars do not have better milage')
if t < 0:
    print('Manual cars do not have better milage')
else:
    print('Manual cars have a better milage')

Manual cars have a better milage

## Answer with the type of stats test you would use (assume normal distribution):
##### Is there a relationship between the length of your arm and the length of your foot?
##### Do guys and gals quit their jobs at the same rate?
##### Does the length of time of the lecture correlate with a students grade?
All of them can be solved using pearsons r test

## Use the telco_churn data.
### Does tenure correlate with monthly charges?
### Total charges?
### What happens if you control for phone and internet service?

In [21]:
url = lib.get_db_url('telco_churn')

In [22]:
query = 'SELECT * FROM customers'
sql = pd.read_sql(query, url)
sql.total_charges = sql.total_charges.replace(' ', np.nan).astype(float)
sql = sql.dropna()
sql

,customer_id,gender,senior_citizen,partner,dependents,tenure,phone_service,multiple_lines,internet_service_type_id,online_security,...,device_protection,tech_support,streaming_tv,streaming_movies,contract_type_id,paperless_billing,payment_type_id,monthly_charges,total_charges,churn
0,0002-ORFBO,Female,0,Yes,Yes,9,Yes,No,1,No,...,No,Yes,Yes,No,2,Yes,2,65.60,593.30,No
1,0003-MKNFE,Male,0,No,No,9,Yes,Yes,1,No,...,No,No,No,Yes,1,No,2,59.90,542.40,No
2,0004-TLHLJ,Male,0,No,No,4,Yes,No,2,No,...,Yes,No,No,No,1,Yes,1,73.90,280.85,Yes
3,0011-IGKFF,Male,1,Yes,No,13,Yes,No,2,No,...,Yes,No,Yes,Yes,1,Yes,1,98.00,1237.85,Yes
4,0013-EXCHZ,Female,1,Yes,No,3,Yes,No,2,No,...,No,Yes,Yes,No,1,Yes,2,83.90,267.40,Yes
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7038,9987-LUTYD,Female,0,No,No,13,Yes,No,1,Yes,...,No,Yes,No,No,2,No,2,55.15,742.90,No
7039,9992-RRAMN,Male,0,Yes,No,22,Yes,Yes,2,No,...,No,No,No,Yes,1,Yes,1,85.10,1873.70,Yes
7040,9992-UJOEL,Male,0,No,No,2,Yes,No,1,No,...,No,No,No,No,1,Yes,2,50.30,92.75,No
7041,9993-LHIEB,Male,0,Yes,Yes,67,Yes,No,1,Yes,...,Yes,Yes,No,Yes,3,No,2,67.85,4627.65,No
7042,9995-HOTOH,Male,0,Yes,Yes,63,No,No phone service,1,Yes,...,Yes,No,Yes,Yes,3,No,1,59.00,3707.60,No

In [23]:
corr, p = stats.pearsonr(sql.tenure, sql.monthly_charges)
corr, p

(0.2468617666408956, 3.9898213232510553e-98)

In [24]:
corr, p = stats.pearsonr(sql.tenure, sql.total_charges)
corr, p

(0.8258804609332071, 0.0)

In [25]:
def rtest(sql): 
    return pd.Series(stats.pearsonr(sql.tenure, sql.monthly_charges), index = ['r', 'p'])

In [26]:
sql.groupby(['phone_service', 'internet_service_type_id']).apply(rtest)

                                               r              p
phone_service internet_service_type_id
No            1                         0.592430   1.173274e-65
Yes           1                         0.658094  5.781402e-216
              2                         0.624621   0.000000e+00
              3                         0.346188   4.896605e-44

## Use the employees database.
### Is there a relationship between how long an employee has been with the company and their salary?
### Is there a relationship between how long an employee has been with the company and the number of titles they have had?

In [27]:
url = lib.get_db_url('employees')
query = 'SELECT s.salary, s.to_date, e.hire_date FROM salaries AS s WHERE to_date >= NOW() JOIN employees AS e ON emp_no'

In [28]:
sql1 = pd.read_sql(query, url)

In [29]:
sql1['tenure'] = (sql1.to_date - sql1.from_date).astype(str).str.split(' ', expand = True)[0].astype(int)

In [30]:
corr, p= stats.pearsonr(sql1.tenure, sql1.salary)
corr, p
# No linear relationship here

(-0.05061363684122239, 5.7749466033550494e-136)

In [31]:
query2 = 'SELECT count(title), emp_no FROM titles GROUP BY emp_no'

In [32]:
sql2 = pd.read_sql(query2, url)
sql2

        count(title)  emp_no
0                  1   10001
1                  1   10002
2                  1   10003
3                  2   10004
4                  2   10005
...              ...     ...
300019             1  499995
300020             2  499996
300021             2  499997
300022             2  499998
300023             1  499999

[300024 rows x 2 columns]

In [33]:
sql3 = sql1.merge(sql2, left_on= 'emp_no', right_on = 'emp_no', how = 'left', indicator = True)
sql3

        emp_no  salary   from_date     to_date   tenure  count(title) _merge
0        10001   88958  2002-06-22  9999-01-01  2920672             1   both
1        10002   72527  2001-08-02  9999-01-01  2920996             1   both
2        10003   43311  2001-12-01  9999-01-01  2920875             1   both
3        10004   74057  2001-11-27  9999-01-01  2920879             2   both
4        10005   94692  2001-09-09  9999-01-01  2920958             2   both
...        ...     ...         ...         ...      ...           ...    ...
240119  499995   52868  2002-06-01  9999-01-01  2920693             1   both
240120  499996   69501  2002-05-12  9999-01-01  2920713             2   both
240121  499997   83441  2001-08-26  9999-01-01  2920972             2   both
240122  499998   55003  2001-12-25  9999-01-01  2920851             2   both
240123  499999   77303  2001-11-29  9999-01-01  2920877             1   both

[240124 rows x 7 columns]

In [34]:
corr, p = stats.pearsonr(sql3.tenure, sql3['count(title)'])
corr, p
# There is no linear relationship here

(-0.041764833387086774, 3.6258231463469627e-93)

## Use the sleepstudy data.
### Is there a relationship between days and reaction time?

In [35]:
slp = data('sleepstudy')

In [36]:
slp

     Reaction  Days  Subject
1    249.5600     0      308
2    258.7047     1      308
3    250.8006     2      308
4    321.4398     3      308
5    356.8519     4      308
..        ...   ...      ...
176  329.6076     5      372
177  334.4818     6      372
178  343.2199     7      372
179  369.1417     8      372
180  364.1236     9      372

[180 rows x 3 columns]

In [37]:
slp_r = slp[['Days', 'Reaction']].groupby(slp.Days).Reaction.mean().reset_index()
slp_r

   Days    Reaction
0     0  256.651806
1     1  264.495756
2     2  265.361900
3     3  282.992011
4     4  288.649422
5     5  308.518456
6     6  312.178256
7     7  318.750583
8     8  336.629506
9     9  350.851222

In [38]:
corr, p = stats.pearsonr(slp_r.Days, slp_r.Reaction)
corr, p

(0.9893180251905143, 5.623495872575358e-08)

In [39]:
corr, x = stats.pearsonr(slp.Days, slp.Reaction)
corr, x

(0.5352302262650255, 9.89409632221439e-15)